/*
    Author: Adamidis Konstantinos

    Περιγραφή:

        Αρχείο που περιέχει συναρτήσεις υπολογισμού του εμβαδόν κύκολου.
        Οι συναρτήσεις αυτές θα χρησιμοποιηθούν στην κατασκευή ενός υπολογιστή
        σε μορφή ιστοσελίδας όπου ο χρήστης μπορεί να εισαγάγει τιμές σε πεδία εισόδου
        και να υπολογίζει το εμβαδόν ανάλογα με τις γνωστές παραμέτρους που έχει στη διάθεσή του.
*/


//έχουμε δεδομένη την μαθηματική σταθερά π(pi) όπου με ακρίβεια οκτώ δεκαδικών ψηφίων είναι ίση με 3,14159265.


// Συνάρτηση υπολογισμού του εμβαδού με γνωστή την ακτίνα (ή και της διάμετρου εφόσον ξέρουμε την ακτίνα).
function CirlceArea_R(r){
    // Αρχικοποιούμε την τιμή του Α σε 0
    let A = 0;
    // Σε περίπτωση που η παράμετρος ρ δεν είναι 0 τότε:
    if (r != 0){
        A = Math.PI * Math.pow(r, 2); // Υπολόγισε το εμβαδόν του κύκολου
    }
    return A; // Επέστρεψε την τιμή του εμβαδού
}


// Συνάρτηση υπολογισμού της ακτίνας (ή και της διάμετρου εφόσον ξέρουμε την ακτίνα) με γνωστό το εμβαδόν.
function CirlceArea_A(A){
    // Αρχικοποιούμε την τιμή του r σε 0
    let r = 0;
    // Σε περίπτωση που η παράμετρος Α δεν είναι 0 τότε:
    if (A != 0){
        r = Math.sqrt(A / Math.PI); // Υπολόγισε την ακτίνα του κύκολου
    }
    return r; // Επέστρεψε την τιμή της ακτίνας
}